zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc_ex.c
        case RCC_USART6CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_USART6CLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_USART6 */
    }

    case RCC_PERIPHCLK_LPTIM2:
    {
      clksource = __HAL_RCC_GET_LPTIM2_SOURCE();

      switch (clksource)
      {
        case RCC_LPTIM2CLKSOURCE_PCLK3:
          frequency = HAL_RCC_GetPCLK3Freq();
          break;

        case RCC_LPTIM2CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_LPTIM2CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_LPTIM2CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_LPTIM2CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_LPTIM2 */
    }

    case RCC_PERIPHCLK_LPTIM3:
    {
      clksource = __HAL_RCC_GET_LPTIM3_SOURCE();

      switch (clksource)
      {
        case RCC_LPTIM3CLKSOURCE_PCLK3:
          frequency = HAL_RCC_GetPCLK3Freq();
          break;

        case RCC_LPTIM3CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_LPTIM3CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_LPTIM3CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_LPTIM3CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_LPTIM3 */
    }

    case RCC_PERIPHCLK_LPTIM45:
    {
      clksource = __HAL_RCC_GET_LPTIM45_SOURCE();

      switch (clksource)
      {
        case RCC_LPTIM45CLKSOURCE_PCLK3:
          frequency = HAL_RCC_GetPCLK3Freq();
          break;

        case RCC_LPTIM45CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_LPTIM45CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_LPTIM45CLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_LPTIM45CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        case RCC_LPTIM45CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_LPTIM45 */
    }

#if defined(RCC_PERIPHCLK_TEMP)
    case RCC_PERIPHCLK_TEMP:
    {
      frequency = LSE_VALUE;
    }
      break;/* RCC_PERIPHCLK_TEMP */
#endif /* RCC_PERIPHCLK_TEMP */

#if defined(RCC_PERIPHCLK_DTS)
    case RCC_PERIPHCLK_DTS:
    {
      frequency = LSE_VALUE;
      break;/* RCC_PERIPHCLK_DTS */
    }
#endif /* RCC_PERIPHCLK_DTS */

    case RCC_PERIPHCLK_LTDC:
    {
      HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
      frequency = pll4_clocks.PLL4_Q_Frequency;
      break;/* RCC_PERIPHCLK_LTDC */
    }


    case RCC_PERIPHCLK_USBPHY:
    {
      clksource = __HAL_RCC_GET_USBPHY_SOURCE();

      switch (clksource)
      {
        case RCC_USBPHYCLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        case RCC_USBPHYCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_USBPHYCLKSOURCE_HSE2:
          frequency = (HSE_VALUE / 2U);
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_USBPHY */
    }


    case RCC_PERIPHCLK_IWDG2:
    {
      frequency = LSI_VALUE;
      break;/* RCC_PERIPHCLK_IWDG2 */

    }


    case RCC_PERIPHCLK_DDRPHYC:
    {
      HAL_RCC_GetPLL2ClockFreq(&pll2_clocks);
      frequency = pll2_clocks.PLL2_R_Frequency;
      break;/*RCC_PERIPHCLK_DDRPHYC */
    }


    case RCC_PERIPHCLK_RTC:
    {
      clksource = __HAL_RCC_GET_RTC_SOURCE();

      switch (clksource)
      {
        case RCC_RTCCLKSOURCE_OFF:
          frequency = 0U;
          break;

        case RCC_RTCCLKSOURCE_LSE:
          frequency = LSE_VALUE;
          break;

        case RCC_RTCCLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        case RCC_RTCCLKSOURCE_HSE_DIV:
          frequency = (HSE_VALUE / __HAL_RCC_GET_RTC_HSEDIV());
          break;
        default:
          break;
      }
      break;/* RCC_PERIPHCLK_RTC */
    }


    case RCC_PERIPHCLK_IWDG1:
    {
      frequency = LSI_VALUE;
      break;/* RCC_PERIPHCLK_IWDG1 */
    }

    case RCC_PERIPHCLK_USART1:
    {
      clksource = __HAL_RCC_GET_USART1_SOURCE();

      switch (clksource)
      {
        case RCC_USART1CLKSOURCE_PCLK6:
          frequency = HAL_RCC_GetPCLK6Freq();
          break;

        case RCC_USART1CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        case RCC_USART1CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_USART1CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_USART1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_Q_Frequency;
          break;

        case RCC_USART1CLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_USART1 */
    }

    case RCC_PERIPHCLK_STGEN:
    {
      clksource = __HAL_RCC_GET_STGEN_SOURCE();

      switch (clksource)
      {
        case RCC_STGENCLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        case RCC_STGENCLKSOURCE_HSE:
          frequency = HSE_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_STGEN */
    }

