zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc_ex.c
#if defined(RCC_PERIPHCLK_DCMIPP)
    case RCC_PERIPHCLK_DCMIPP:
    {
      clksource = __HAL_RCC_GET_DCMIPP_SOURCE();

      switch (clksource)
      {
        case RCC_DCMIPPCLKSOURCE_ACLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_DCMIPPCLKSOURCE_PLL2:
          HAL_RCC_GetPLL2ClockFreq(&pll2_clocks);
          frequency = pll2_clocks.PLL2_Q_Frequency;
          break;

        case RCC_DCMIPPCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_DCMIPPCLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_DCMIPP */
    }
#endif /* RCC_PERIPHCLK_DCMIPP */

#if defined(RCC_PERIPHCLK_SAES)
    case RCC_PERIPHCLK_SAES:
    {
      clksource = __HAL_RCC_GET_SAES_SOURCE();

      switch (clksource)
      {
        case RCC_SAESCLKSOURCE_ACLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_SAESCLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_SAESCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_SAESCLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_SAES */
    }
#endif /* RCC_PERIPHCLK_SAES */

    case RCC_PERIPHCLK_QSPI:
    {
      clksource = __HAL_RCC_GET_QSPI_SOURCE();

      switch (clksource)
      {
        case RCC_QSPICLKSOURCE_ACLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_QSPICLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_QSPICLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_QSPICLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_QSPI */
    }

    case RCC_PERIPHCLK_ETH1:
    {
      clksource = __HAL_RCC_GET_ETH1_SOURCE();

      switch (clksource)
      {
        case RCC_ETH1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_ETH1CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_ETH1 */
    }

    case RCC_PERIPHCLK_ETH2:
    {
      clksource = __HAL_RCC_GET_ETH2_SOURCE();

      switch (clksource)
      {
        case RCC_ETH2CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_ETH2CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0U;
          break;
      }
      break;/* RCC_PERIPHCLK_ETH2 */
    }

    case RCC_PERIPHCLK_FMC:
    {
      clksource = __HAL_RCC_GET_FMC_SOURCE();

      switch (clksource)
      {
        case RCC_FMCCLKSOURCE_ACLK:
          frequency = HAL_RCC_GetACLKFreq();
          break;

        case RCC_FMCCLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_FMCCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_FMCCLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        default:
          break;
      }
      break;/* RCC_PERIPHCLK_FMC */
    }

    case RCC_PERIPHCLK_USBO:
    {
      clksource = __HAL_RCC_GET_USBO_SOURCE();

      switch (clksource)
      {
        case RCC_USBOCLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_USBOCLKSOURCE_PHY:
          frequency = USB_PHY_VALUE;
          break;

        default:
          break;
      }
      break;/* RCC_PERIPHCLK_USBO */
    }

    case RCC_PERIPHCLK_ADC1:
    {
      clksource = __HAL_RCC_GET_ADC1_SOURCE();

      switch (clksource)
      {
        case RCC_ADC1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_ADC1CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_ADC1CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_ADC1 */

    }

    case RCC_PERIPHCLK_ADC2:
    {
      clksource = __HAL_RCC_GET_ADC2_SOURCE();

      switch (clksource)
      {
        case RCC_ADC2CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_ADC2CLKSOURCE_PER:
          frequency = RCC_GetCKPERFreq();
          break;

        case RCC_ADC2CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_Q_Frequency;
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_ADC2 */
    }

    case RCC_PERIPHCLK_RNG1:
    {
      clksource = __HAL_RCC_GET_RNG1_SOURCE();

      switch (clksource)
      {
        case RCC_RNG1CLKSOURCE_CSI:
          frequency = CSI_VALUE;
          break;

        case RCC_RNG1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_R_Frequency;
          break;

        case RCC_RNG1CLKSOURCE_LSI:
          frequency = LSI_VALUE;
          break;

        default:
          break;
      }
      break;/* RCC_PERIPHCLK_RNG1 */
    }

    case RCC_PERIPHCLK_SDMMC1:
    {
      clksource = __HAL_RCC_GET_SDMMC1_SOURCE();

      switch (clksource)
      {
        case RCC_SDMMC1CLKSOURCE_HCLK6:
          frequency = HAL_RCC_GetHCLK6Freq();
          break;

        case RCC_SDMMC1CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

        case RCC_SDMMC1CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_SDMMC1CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_SDMMC1 */
    }

    case RCC_PERIPHCLK_SDMMC2:
    {
      clksource = __HAL_RCC_GET_SDMMC2_SOURCE();

      switch (clksource)
      {
        case RCC_SDMMC2CLKSOURCE_HCLK6:
          frequency = HAL_RCC_GetHCLK6Freq();
          break;

        case RCC_SDMMC2CLKSOURCE_PLL3:
          HAL_RCC_GetPLL3ClockFreq(&pll3_clocks);
          frequency = pll3_clocks.PLL3_R_Frequency;
          break;

