zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_rcc_ex.c
        case RCC_SDMMC2CLKSOURCE_PLL4:
          HAL_RCC_GetPLL4ClockFreq(&pll4_clocks);
          frequency = pll4_clocks.PLL4_P_Frequency;
          break;

        case RCC_SDMMC2CLKSOURCE_HSI:
          frequency = (HSI_VALUE >> __HAL_RCC_GET_HSI_DIV());
          break;

        default:
          frequency = 0U;
          break;
      }
      break; /* RCC_PERIPHCLK_SDMMC2 */
    }

    case RCC_PERIPHCLK_TIMG1:
    {
      frequency = HAL_RCC_GetMLAHBFreq();

      if (__HAL_RCC_GET_TIMG1PRES() == RCC_TIMG1PRES_ACTIVATED)
      {
        switch (__HAL_RCC_GET_APB1_DIV())
        {
          case RCC_APB1_DIV1:
          case RCC_APB1_DIV2:
          case RCC_APB1_DIV4:
            break;
          case RCC_APB1_DIV8:
            frequency /= 2U;
            break;
          case RCC_APB1_DIV16:
            frequency /= 4U;
            break;
          default:
            break;
        }
      }
      else
      {
        switch (__HAL_RCC_GET_APB1_DIV())
        {
          case RCC_APB1_DIV1:
          case RCC_APB1_DIV2:
            break;
          case RCC_APB1_DIV4:
            frequency /= 2U;
            break;
          case RCC_APB1_DIV8:
            frequency /= 4U;
            break;
          case RCC_APB1_DIV16:
            frequency /= 8U;
            break;
          default:
            break;
        }
      }
      break;
    }


    case RCC_PERIPHCLK_TIMG2:
    {
      frequency = HAL_RCC_GetMLAHBFreq();

      if (__HAL_RCC_GET_TIMG2PRES() == RCC_TIMG2PRES_ACTIVATED)
      {
        switch (__HAL_RCC_GET_APB2_DIV())
        {
          case RCC_APB2_DIV1:
          case RCC_APB2_DIV2:
          case RCC_APB2_DIV4:
            break;
          case RCC_APB2_DIV8:
            frequency /= 2U;
            break;
          case RCC_APB2_DIV16:
            frequency /= 4U;
            break;
          default:
            break;
        }
      }
      else
      {
        switch (__HAL_RCC_GET_APB2_DIV())
        {
          case RCC_APB2_DIV1:
          case RCC_APB2_DIV2:
            break;
          case RCC_APB2_DIV4:
            frequency /= 2U;
            break;
          case RCC_APB2_DIV8:
            frequency /= 4U;
            break;
          case RCC_APB2_DIV16:
            frequency /= 8U;
            break;
          default:
            break;
        }
      }
      break;
    }


    default:
      break;
  }
  return (frequency);
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
